//Написать прогу, кот. перевернет одномерный массив.
//например : [1 2 3 4 5]->[5 4 3 2 1]
/*int[] array = new int[10];
Console.WriteLine("Ваш массив: ");
{
    for (int i = 0; i < array.Length; i++)
    {
        array[i] = new Random().Next(100, 1000);
        Console.Write(array[i]+" ");
    }
    for (int i = 0; i < array.Length/2; i++)
    {
        int t = array[i];
        array[i] = array[array.Length - i - 1];
        array[array.Length - i - 1] = t;
    }
    Console.WriteLine();
    Console.Write("Перевернутый массив: ");
    for (int i = 0; i < array.Length; i++)
{
    
     Console.Write(array[i]+" ");
     }}*/

//Задача 40. Написать прогу, кот. принимает на вход 3 числа и проверяет может ли существовать
//треугольник со сторонами такой длины. Вспоминая теорему о неравенстве треуг-ка:
//каждая сторона треуг-ка меньше суммы 2-х других сторон.


//Задача 42. Написать прогу, кот. будет преобразовывать десятичное число в двоичное:
//45->101101, 3->11, 2->10

